mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
                }
                configStatus = true;
            }
            else{
                configStatus = false;
            }
            break;
        /***** Logging *****/
        case MSPCommand::SEND_LOG_MSG:
            mqttHelper.publishLog(buffer);
            break;

        /***** Wifi Config *****/
        case MSPCommand::WIFI_RECEIVE_SSID:
            receiveNewCredentials(buffer, NULL);
            break;
        case MSPCommand::WIFI_RECEIVE_PASSWORD:
            receiveNewCredentials(NULL, buffer);
            break;
        case MSPCommand::WIFI_RECEIVE_AUTH_TYPE:       
            strcpy(m_wifiAuthType,buffer);
            //hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST, m_wifiAuthType);
            //delay(1);
            break;
        case MSPCommand::WIFI_FORGET_CREDENTIALS:
            forgetWiFiCredentials();
            disconnectWifi();
            break;
        case MSPCommand::WIFI_RECEIVE_STATIC_IP:
        case MSPCommand::WIFI_RECEIVE_GATEWAY:
        case MSPCommand::WIFI_RECEIVE_SUBNET:
        case MSPCommand::WIFI_RECEIVE_DNS1:
        case MSPCommand::WIFI_RECEIVE_DNS2:
            receiveNewStaticConfig(
                iuSerial->mspReadIPAddress(),
                (uint8_t) cmd - (uint8_t) MSPCommand::WIFI_RECEIVE_STATIC_IP);
            break;
        case MSPCommand::WIFI_FORGET_STATIC_CONFIG:
            forgetWiFiStaticConfig();
            break;

        /***** Wifi commands *****/
        case MSPCommand::WIFI_SOFT_RESET:
            ESP.restart(); // ESP32_PORT_TRUE
            break;
        case MSPCommand::WIFI_CONNECT:
            // Reset disconnection timer
            m_disconnectionTimerStart = millis();
            wifiConnectTryFlag = true;
            reconnect();
            break;
        case MSPCommand::WIFI_DISCONNECT:
            disconnectWifi();
            break;
        case MSPCommand::MQTT_CONNECT:
            // Reset disconnection timer
            m_disconnectionMqttTimerStart = millis();
            loopMQTT();
            break;
        case MSPCommand::MQTT_DISCONNECT:
            disconnectMQTT();
            break;
        
        // case MSPCommand::GET_ESP_RSSI:
        //     hostSerial.sendMSPCommand(MSPCommand::GET_ESP_RSSI,String(WiFi.RSSI()).c_str() );
        //     break;
        /****** WiFI Radio Control *****/
        case MSPCommand::WIFI_GET_TX_POWER:
            wifi_power_t txpower;
            txpower  =  WiFi.getTxPower();
            char esp_radio[50];
            snprintf(esp_radio,50,"ESP32 Current TX PWR : %d",txpower);
            hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST, esp_radio);
            mqttHelper.publish(DIAGNOSTIC_TOPIC,esp_radio);
            break;
        case MSPCommand::WIFI_SET_TX_POWER:
            {
            int cmd(0), radioMode(0);
            int modeSet,currentTXpower;
            sscanf(buffer, "%d-%d", &cmd, &radioMode);
            char esp_radio[50];
            switch (radioMode)
            {
                case 0:
                    modeSet = WiFi.setTxPower(WIFI_POWER_19_5dBm);
                    break;
                case 1:
                    modeSet = WiFi.setTxPower(WIFI_POWER_19dBm);
                    break;
                case 2:
                    modeSet = WiFi.setTxPower(WIFI_POWER_18_5dBm);
                    break;
                case 3:
                    modeSet = WiFi.setTxPower(WIFI_POWER_17dBm);
                    break;
                case 4:
                    modeSet = WiFi.setTxPower(WIFI_POWER_15dBm);
                    break;
                case 5:
                    modeSet = WiFi.setTxPower(WIFI_POWER_13dBm);
                    break;
                case 6:
                    modeSet = WiFi.setTxPower(WIFI_POWER_11dBm);
                    break;
                case 7:
                    modeSet = WiFi.setTxPower(WIFI_POWER_8_5dBm);
                    break;
                case 8:
                    modeSet = WiFi.setTxPower(WIFI_POWER_7dBm);
                    break;
                case 9:
                    modeSet = WiFi.setTxPower(WIFI_POWER_5dBm);
                    break;
                case 10:
                    modeSet = WiFi.setTxPower(WIFI_POWER_2dBm);
                    break;
                case 11:
                    modeSet = WiFi.setTxPower(WIFI_POWER_MINUS_1dBm);
                    break;
    
                default:
                    break;
            }
            // currentTXpower = WiFi.getTxPower();
            // snprintf(esp_radio,50,"ESP32 TX PWR : %d,%d,%d,%d",cmd,radioMode,modeSet,currentTXpower);
            // hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST, esp_radio);
            
            break;
            }

        /***** Data publication *****/
        // Implemented in Host Firmware v1.1.3
        case MSPCommand::PUBLISH_DEVICE_DETAILS_MQTT:
            mqttHelper.publish(COMMAND_RESPONSE_TOPIC, buffer);
            break;
        case MSPCommand::PUBLISH_RAW_DATA:      //not used in Host Firmware v1.1.2
           
            if (accelRawDataHelper.inputHasTimedOut()) {
                accelRawDataHelper.resetPayload();
            }
            accelRawDataHelper.addKeyValuePair(buffer[0], &buffer[2],
                                               strlen(buffer) - 2);
            iuSerial->sendMSPCommand(MSPCommand::WIFI_CONFIRM_ACTION, buffer, 1);
            accelRawDataHelper.publishIfReady(m_bleMAC);
                  
            break;
        case MSPCommand::PUBLISH_FEATURE:
            if (publishFeature(&buffer[7], bufferLength - 7, buffer, 6)) {
                iuSerial->sendMSPCommand(MSPCommand::WIFI_CONFIRM_PUBLICATION);
            }
            break;
        case MSPCommand::PUBLISH_FEATURE_WITH_CONFIRMATION:
            // Buffer structure:
            // "[confirmation_id (1 char)]:[feature_group (6 chars)],[feature msg]"
            if (publishFeature(&buffer[9], bufferLength - 9, &buffer[2], 6)) {
                iuSerial->sendMSPCommand(MSPCommand::WIFI_CONFIRM_PUBLICATION,
                                         &buffer[0], 1);
            }
            break;
        case MSPCommand::PUBLISH_DIAGNOSTIC:
            publishDiagnostic(buffer, bufferLength);
            break;
        case MSPCommand::PUBLISH_FIRMWARE_VER:  
            mqttHelper.publishDiagnostic(buffer);
            break;
        case MSPCommand::PUBLISH_CONFIG_CHECKSUM:
            mqttHelper.publish(CHECKSUM_TOPIC, buffer);
            break;
        case MSPCommand::PUBLISH_IU_DIAGNOSTIC:
            mqttHelper.publish(IU_DIG_RULE_ENGINE_TOPIC,buffer);
            break;
        case MSPCommand::PUBLISH_IU_RDIG:
            mqttHelper.publish(IU_RDIG_RULE_ENGINE_TOPIC,buffer);
            break;
        case MSPCommand::PUBLISH_IU_FRES:
            mqttHelper.publish(IU_FRES,buffer);
            break;
        /***** Cloud command reception and transmission *****/
        case MSPCommand::HOST_CONFIRM_RECEPTION:
            // TODO Implement
            break;
        case MSPCommand::HOST_FORWARD_CMD:
            // TODO Implement
            break;

        /***** Publication protocol selection *****/
        case MSPCommand::PUBLICATION_USE_MQTT:
            m_useMQTT = true;
            break;
        case MSPCommand::PUBLICATION_USE_HTTP:
            m_useMQTT = false;
            break;

