mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
                snprintf(metaData_ack_config, 150, "{\"messageType\":\"meta-data-ack\",\"mac\":\"%s\",\"httpCode\":\"%d\",\"timestamp\":%.3f}",
                         m_bleMAC.toString().c_str(),httpStatusCode,timeStamp);
                mqttHelper.publish(COMMAND_RESPONSE_TOPIC, metaData_ack_config);
                //iuSerial->sendMSPCommand(MSPCommand::RECEIVE_METADATA_ACK, metaData_ack_config); 
            }
            break;    
        case MSPCommand::SEND_RAW_DATA:
          {
            if(iuWiFiFlash.readMemory(CONNECTION_MODE) == SECURED ){

            //Apply the OEM rootCA cert
                memset(ssl_rootca_cert,0x00,sizeof(ssl_rootca_cert));
                memset(ssl_oem_rootca_cert,0x00,sizeof(ssl_oem_rootca_cert));
                //Apply the rootCA cert
                if(activeCertificates == 0){
                    //Serial.println("\nUsing ROOTCA 0");
                    iuWiFiFlash.readFile(IUESPFlash::CFG_HTTPS_ROOTCA0,ssl_rootca_cert,sizeof(ssl_rootca_cert));
                }else
                {   //Serial.println("\nUsing rootCA 1");
                    iuWiFiFlash.readFile(IUESPFlash::CFG_HTTPS_ROOTCA1,ssl_rootca_cert,sizeof(ssl_rootca_cert));
                }

                //Apply the OEM rootCA cert
                if(activeCertificates == 0){
                    //Serial.println("\nUsing ROOTCA 0");
                    iuWiFiFlash.readFile(IUESPFlash::CFG_HTTPS_OEM_ROOTCA0,ssl_oem_rootca_cert,sizeof(ssl_oem_rootca_cert));
                }else
                {   //Serial.println("\nUsing rootCA 1");
                    iuWiFiFlash.readFile(IUESPFlash::CFG_HTTPS_OEM_ROOTCA1,ssl_oem_rootca_cert,sizeof(ssl_oem_rootca_cert));
                }
            }
           IUMessageFormat::rawDataPacket* rawData = (IUMessageFormat::rawDataPacket*) buffer;
            char ack_config[150];

            if (accelRawDataHelper.inputHasTimedOut()) {
                accelRawDataHelper.resetPayload();
            }

            // Only X axis timestamp is recorded so that record times can be correlated on server
            if (rawData->axis == 'X') timestamp = rawData->timestamp;
          
            // This mechanism ensures the ESP sends out only blockSize data points in the POST payload
            // Tried implementing this using structures, but ran into problems. See commented code in 
            //  IUMessage.h for details.
            int rawValuesSize = HOST_BLOCK_SIZE * 2;                // since 1 q15_t occupies 2 bytes
            int httpBufferSize = macIdSize + hostFirmwareVersionSize + timestampSize 
                            + blockSizeSize + samplingRateSize + axisSize + rawValuesSize;      // metadata total size will be constant(43 bytes) + variable block size
            int httpBufferPointer = 0;                      // keeps track of how many bytes are filed in the HTTP buffer 

            memcpy(&httpBuffer[httpBufferPointer], m_bleMAC.toString().c_str(), macIdSize);
            httpBufferPointer += macIdSize;

            memcpy(&httpBuffer[httpBufferPointer], HOST_FIRMWARE_VERSION, hostFirmwareVersionSize);
            httpBufferPointer += hostFirmwareVersionSize;

            memcpy(&httpBuffer[httpBufferPointer], &timestamp, timestampSize);
            httpBufferPointer += timestampSize;

            memcpy(&httpBuffer[httpBufferPointer], &HOST_BLOCK_SIZE, blockSizeSize);            
            httpBufferPointer += blockSizeSize;

            memcpy(&httpBuffer[httpBufferPointer], &HOST_SAMPLING_RATE, samplingRateSize);
            httpBufferPointer += samplingRateSize;

            memcpy(&httpBuffer[httpBufferPointer], &rawData->axis, axisSize);
            httpBufferPointer += axisSize;
            
            memcpy(&httpBuffer[httpBufferPointer], rawData->txRawValues, rawValuesSize);
            httpBufferPointer += rawValuesSize;

            iuSerial->sendMSPCommand(MSPCommand::WIFI_CONFIRM_ACTION, &rawData->axis, 1);
            static int httpOEMStatusCode = 0;
            static int httpStatusCode = 0;
            RawdataHTTPretryCount = 0;
            RawdataHTTPSretryCount = 0;
            bool sendNextAxis = false;
            if((rawData->axis == 'X' || httpStatusCode == 200)){
                while(RawdataHTTPSretryCount < 3 ){
                    if((millis() - HTTPSRawDataTimeout) > HTTPSRawDataRetryTimeout){
                        HTTPSRawDataTimeout = millis();
                        if(iuWiFiFlash.readMemory(CONNECTION_MODE) == UNSECURED ){
                            httpStatusCode = httpPostBigRequest(accelRawDataHelper.m_endpointHost, accelRawDataHelper.m_endpointRoute,
                                                    accelRawDataHelper.m_endpointPort, (uint8_t*) &httpBuffer, 
                                                    httpBufferPointer,"", NULL, HttpContentType::octetStream);
                        }else{    
                            httpStatusCode = httpsPostBigRequest(accelRawDataHelper.m_endpointHost, accelRawDataHelper.m_endpointRoute,
                                                    accelRawDataHelper.m_endpointPort, (uint8_t*) &httpBuffer, 
                                                    httpBufferPointer,"", ssl_rootca_cert, HttpContentType::octetStream);            
                        }            

                        // send HTTP status code back to the MCU
                        char httpAckBuffer[1 + 4];      // axis + 3 digit HTTP status code + null terminator
                        httpAckBuffer[0] = rawData->axis;
                        itoa(httpStatusCode, &httpAckBuffer[1], 10);
                        iuSerial->sendMSPCommand(MSPCommand::HTTPS_ACK, httpAckBuffer);

                        // send HTTP status code to MQTT
                        snprintf(ack_config, 150, "{\"messageType\":\"raw-data-ack\",\"mac\":\"%s\",\"httpCode\":\"%d\",\"axis\":\"%c\",\"timestamp\":%.3f}",
                        m_bleMAC.toString().c_str(),httpStatusCode, rawData->axis, timestamp);
                        mqttHelper.publish(COMMAND_RESPONSE_TOPIC, ack_config);
                        if((httpStatusCode == 200)){
                            break;
                        }
                        RawdataHTTPSretryCount++;
                    }
                }
            }

