mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
            if((rawData->axis == 'X' || httpOEMStatusCode == 200) && accelRawDataHelper.httpsOEMConfigPresent && (iuWiFiFlash.readMemory(CONNECTION_MODE) == true )){

                while(RawdataHTTPretryCount < 3 ){
                    if((millis() - HTTPRawDataTimeout) > HTTPRawDataRetryTimeout){
                        HTTPRawDataTimeout = millis();
                        if(iuWiFiFlash.readMemory(CONNECTION_MODE) == UNSECURED ){      // Not Required
                            httpOEMStatusCode = httpPostBigRequest(accelRawDataHelper.m_endpointHost_oem, accelRawDataHelper.m_endpointRoute_oem,
                                                            accelRawDataHelper.m_endpointPort_oem, (uint8_t*) &httpBuffer, 
                                                            httpBufferPointer,"", NULL, HttpContentType::octetStream);            
                        }else{
                            httpOEMStatusCode = httpsPostBigRequest(accelRawDataHelper.m_endpointHost_oem, accelRawDataHelper.m_endpointRoute_oem,
                                                        accelRawDataHelper.m_endpointPort_oem, (uint8_t*) &httpBuffer, 
                                                        httpBufferPointer,"", NULL, HttpContentType::octetStream);            //Need to change here if OEM provides root certificate
          
                        }            

                        // send HTTP status code back to the MCU
                        char httpOEMAckBuffer[1 + 4];      // axis + 3 digit HTTP status code + null terminator
                        httpOEMAckBuffer[0] = rawData->axis;
                        itoa(httpOEMStatusCode, &httpOEMAckBuffer[1], 10);
                        iuSerial->sendMSPCommand(MSPCommand::HTTPS_OEM_ACK, httpOEMAckBuffer);

                        // send HTTP status code to MQTT
                        snprintf(ack_config, 150, "{\"messageType\":\"raw-data-oem-ack\",\"mac\":\"%s\",\"httpCode\":\"%d\",\"axis\":\"%c\",\"timestamp\":%.3f}",
                        m_bleMAC.toString().c_str(),httpOEMStatusCode, rawData->axis, timestamp);
                        mqttHelper.publish(COMMAND_RESPONSE_TOPIC, ack_config);
                        RawdataHTTPretryCount++;
                        if(httpOEMStatusCode == 200){
                            break;
                        }
                    }
                }
                
            }
            
            if ( (httpStatusCode == 200 || httpOEMStatusCode == 200) && rawData->axis != 'Z'){
                sendNextAxis = true;
            }
           iuSerial->sendMSPCommand(MSPCommand::SEND_RAW_DATA_NEXT_PKT, String(sendNextAxis).c_str());
           break;  
          }
        case MSPCommand::RECEIVE_HTTP_CONFIG_ACK:
          // Send the Ack to Topic
            mqttHelper.publish(COMMAND_RESPONSE_TOPIC,buffer);
                   
            break;
        case MSPCommand::SEND_FLASH_STATUS:
            mqttHelper.publish(DIAGNOSTIC_TOPIC,buffer); 
            break;                
        case MSPCommand::SEND_SENSOR_STATUS:
          // Send the Ack to Topic
            mqttHelper.publish(COMMAND_RESPONSE_TOPIC,buffer);
            break;
        case MSPCommand::DOWNLOAD_TLS_SSL_START:
                certificateDownloadInitInProgress = true;
                certificateDownloadInProgress = true;
                if(downloadAborted  == false && (newEapCertificateAvailable == true || newEapPrivateKeyAvailable == true || 
                    newMqttcertificateAvailable == true || newMqttPrivateKeyAvailable == true || newRootCACertificateAvailable == true || newOEMRootCACertificateAvailable == true/*|| upgradeReceived*/ ) ){
                    // Note : upgradeReceived flage is optional here, in upgrade new cert are having different checksum above all  flags will alreay set to true
                    // added temp for testing upgrade    
                    //Serial.println("\nESP32 DEBUG : DOWNLOADING STARTED ....");
                    publishedDiagnosticMessage(buffer,bufferLength);
                    certificateDownloadStatus = download_tls_ssl_certificates();
                    iuWiFiFlash.updateValue(CERT_DOWNLOAD_STATUS,certificateDownloadStatus);
                    if(certificateDownloadStatus == 1){
                        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_SUCCESS, String(getRca(CERT_DOWNLOAD_COMPLETE)).c_str());
                        if(activeCertificates == 1){
                            if(initialFileDownload){
                                //Serial.println("Initial File Download , Updated Value ");
                                initialFileDownload = false;
                            }
                           activeCertificates = iuWiFiFlash.updateValue(CERT_ADDRESS,0);
                        }else{
                           activeCertificates = iuWiFiFlash.updateValue(CERT_ADDRESS,1);
                        }
                        //Serial.println("\nESP32 DEBUG : DOWNLOADING SUCCESSFULLY COMPLETED....");
                        delay(10);
                        ESP.restart();
                    }
                }else
                {
                    //Serial.println("\nESP32 DEBUG : No Need to Update the Certificates");
                    hostSerial.sendMSPCommand(MSPCommand::CERT_NO_DOWNLOAD_AVAILABLE, String(getRca(CERT_NEW_CERT_NOT_AVAILBLE)).c_str());
                }
                   
                delay(200);
                resetMqttConnectionFlags();
                certificateDownloadInitInProgress = false;
                newEapCertificateAvailable = false;
                newEapPrivateKeyAvailable = false;
                newMqttcertificateAvailable = false;  
                newMqttPrivateKeyAvailable = false;
                newRootCACertificateAvailable = false;
                if(accelRawDataHelper.httpsOEMConfigPresent){
                        newOEMRootCACertificateAvailable = false;
                    }
                //Serial.println("\nESP32 DEBUG : ALL FLAGS RESET ....");    
                
            break;
        case MSPCommand::UPGRADE_TLS_SSL_START:
             // TODO : Upgrade the Certificate read from the file and Upgrade

            break;
        case MSPCommand::SET_CERT_CONFIG_URL:
          {
            // Store the URL into .conf file
            lastReqHash = millis(); // Reset check hash time to avoid sending req during reception of CERT Confg
            bool written = iuWiFiFlash.writeFile(IUESPFlash::CFG_STATIC_CERT_ENDPOINT,buffer,bufferLength-1);   
            if(written && buffer != NULL){
                // Serial.println("\nESP32 DEBUG : static url config type success"); 
                 //downloadInitTimer = true;  
                 if(debugMode){
                     debugPrint("MQTT Certificate Manager Endpoint configured successfully");
                 }
            }else
            {
                // Failed to write to Flash File system, or Empty Buffer received 
                // TODO : Publish status to diagnostic endpoint
                if(!written){
                    hostSerial.sendMSPCommand(MSPCommand::ESP32_FLASH_FILE_WRITE_FAILED);
                    //Serial.println("\nESP32 DEBUG : ESP32_FLASH_FILE_WRITE_FAILED");
                }else if(buffer == NULL ) {
                    //Serial.println("\nESP32 DEBUG : Empty URL received");
                }
                hostSerial.sendMSPCommand(MSPCommand::CERT_INVALID_STATIC_URL);               
                    
