mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
            }
            break;
          }
        case MSPCommand::GET_CERT_DOWNLOAD_CONFIG:
          {
            StaticJsonBuffer<512> jsonBuffer;
            JsonVariant config = JsonVariant(iuWiFiFlash.loadConfigJson(IUESPFlash::CFG_STATIC_CERT_ENDPOINT,jsonBuffer));
            bool success = config.success();
            //Serial.print("Certificate Manager JSON :");
            //config.prettyPrintTo(Serial);
            
            if( success && WiFi.isConnected() && Ping.ping("www.google.com" , 1)){
                
                const char* host = config["certUrl"]["host"].as<char*>() ; 
                int port = config["certUrl"]["port"].as<int>() ; 
                const char* path = config["certUrl"]["path"].as<char*>() ;
                String commonUrl = host + String(":") + String(port) + path ;
                commonUrl +=m_bleMAC.toString();   
                const char* staticURL = commonUrl.c_str();
                //Serial.println("\nESP32 DEBUG: GET the Certificates Download Config");
                String auth = setBasicHTTPAutherization();
                //Serial.print("URL : ");Serial.println(staticURL);
                int httpCode = httpGetRequest(staticURL,certDownloadResponse,sizeof(certDownloadResponse),auth); 
                int16_t responseLength = sizeof(certDownloadResponse);
                //Serial.print("\nHTTP CODE : ");Serial.println(httpCode);
                if( responseLength >0 && httpCode == HTTP_CODE_OK  ) {
                    char jsonResponse[responseLength+1];
                    strcpy(jsonResponse,certDownloadResponse);
                        // Checksum valication to check for new cert download
                        messageValidation(jsonResponse);          
                        if( newEapCertificateAvailable || newEapPrivateKeyAvailable ||  newRootCACertificateAvailable || 
                            newMqttcertificateAvailable || newMqttPrivateKeyAvailable || newOEMRootCACertificateAvailable /*|| upgradeReceived*/ )  // Note : upgradeReceived flasg is optional here
                            { 
                                // Store the response message in esp32 flash file system
                                bool configWritten = iuWiFiFlash.writeFile(IUESPFlash::CFG_CERT_UPGRADE_CONFIG,jsonResponse, sizeof(jsonResponse) );
                                if(!configWritten){
                                    // Failed to write to Flash File system 
                                    // TODO : Publish status to diagnostic endpoint
                                    hostSerial.sendMSPCommand(MSPCommand::ESP32_FLASH_FILE_WRITE_FAILED);
                                    //Serial.println("\nESP32 DEBUG : ESP32_FLASH_FILE_WRITE_FAILED");
                                    delay(1); 
                                    //hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT);
                                    hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(CERT_FILESYSTEM_READ_WRITE_FAILED)).c_str());
                                    downloadAborted = true;
                                    upgradeReceived = false;
                                }else
                                {
                                    //Serial.println("\nESP32 DEBUG : Config JOSN File  Upgrade completed ---------");
                                    hostSerial.sendMSPCommand(MSPCommand::DOWNLOAD_TLS_SSL_START);
                                    downloadAborted = false;
                                    
                                }
                            }
                
                }else
                {
                    // https GET request failed
                    // Send the ACK / NACK to Diagnostic endpoints and inform the STM32 and stop the OTA/Certificate Download mode
                    // TODO : Publish status to diagnostic endpoints
                    // TODO : Get the http error code based on above httpCode 
                    if(httpCode != HTTP_CODE_OK) {
                        // Send the HTTP Faliure Code with RCA
                        //Serial.print("\nESP32 DEBUG : HTTP Failed : "); Serial.println(httpCode);
                        certificateDownloadInProgress =true;    // Set to send the RCA
                        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(httpCode)).c_str());
                        certificateDownloadInProgress = false;
                        downloadAborted = true;
                        
                    }
                    downloadAborted = true;
                    upgradeReceived = false;
                    //hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT);
                    //Serial.println("\nESP32 DEBUG :STOP CERT Download Mode");

                }
                
            }else
            {
                // Invalid Response Json or WiFI client not connected 
                // TODO : Publish status to diagnostic endpoint
                if(! WiFi.isConnected() || !success ) {
                    
                    if(!success) {
                        //Serial.println("\nESP32 DEBUG : Invalid Static URL Config JSON Response or File Not available");
                        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(CERT_STATIC_URL_FILE_NOT_PRESENT)).c_str() );
                    }else{ 
                        //Serial.println("\nESP32 DEBUG : Wifi client disconnected ");
                    }

                }
                downloadAborted = true;
                upgradeReceived = false;                    
            }
            break;
          }
        
        case MSPCommand::DELETE_CERT_FILES:
            for(int i = 0; i < IUESPFlash::CFG_COUNT;i++){
                iuWiFiFlash.removeFile((IUESPFlash::storedConfig)i);
                delay(1);
            }
            iuWiFiFlash.updateValue(CERT_ADDRESS,0);
            iuWiFiFlash.updateValue(CONNECTION_MODE,UNSECURED);
            hostSerial.sendMSPCommand(MSPCommand::DELETE_CERT_FILES,"succefully Deleted, Rebooting ESP");
            delay(10);
            ESP.restart();
            break;
        case MSPCommand::GET_CERT_CONFIG:
        {
            bool isConfigPresent = iuWiFiFlash.isFilePresent(IUESPFlash::CFG_STATIC_CERT_ENDPOINT);
            if(!isConfigPresent){
                if(debugMode){
                    debugPrint("Using Default cert Config Urls");
                }
                String certURL = CERT_CONFIG_DEFAULT_ENDPOINT_HOST + String(":") +String( CERT_CONFIG_DEFAULT_ENDPOINT_PORT) +
                                 CERT_CONFIG_DEFAULT_ENDPOINT_PATH;
                String digURL =  CERT_CONFIG_DEFAULT_ENDPOINT_HOST + String(":") + String(DIAGNOSTIC_DEFAULT_ENDPOINT_PORT) +
                                 DIAGNOSTIC_DEFAULT_ENDPOINT_PATH;
                hostSerial.sendMSPCommand(MSPCommand::SEND_CERT_DWL_CFG,certURL.c_str());
                hostSerial.sendMSPCommand(MSPCommand::SEND_CERT_DIG_CFG,digURL.c_str());

                // publish to mqtt
                publishDiagnostic(certURL.c_str(),256);
                publishDiagnostic(digURL.c_str(),256);
                break;
            }
            StaticJsonBuffer<512> JsonBuffer;
            JsonObject& certConfig = iuWiFiFlash.loadConfigJson(IUESPFlash::CFG_STATIC_CERT_ENDPOINT,JsonBuffer);
            bool validConfig = certConfig.success();
            // String certConfigChar;
            // certConfig.printTo(certConfigChar);
            //config.prettyPrintTo(Serial);
            if (validConfig)
            {   
                char certUrlConfig[256];
                sprintf(certUrlConfig,"CERT URL : %s:%d%s",certConfig["certUrl"]["host"].as<char*>(),certConfig["certUrl"]["port"].as<int>(),certConfig["certUrl"]["path"].as<char*>()  );//certConfigChar.c_str());
                hostSerial.sendMSPCommand(MSPCommand::SEND_CERT_DWL_CFG,certUrlConfig);
                publishDiagnostic(certUrlConfig,sizeof(certUrlConfig));
            }
            JsonObject& diagConfig = iuWiFiFlash.loadConfigJson(IUESPFlash::CFG_DIAGNOSTIC_ENDPOINT,JsonBuffer);
            bool validDigConfig = diagConfig.success();
            // String diagConfigChar;
            // diagConfig.printTo(diagConfigChar);
            if (validDigConfig)
            {
                char diagUrlConfig[256];
                sprintf(diagUrlConfig,"DIAG URL : %s:%d%s",diagConfig["diagnosticUrl"]["host"].as<char*>() ,diagConfig["diagnosticUrl"]["port"].as<int>(),diagConfig["diagnosticUrl"]["path"].as<char*>()  );
                hostSerial.sendMSPCommand(MSPCommand::SEND_CERT_DIG_CFG,diagUrlConfig);
                publishDiagnostic(diagUrlConfig,sizeof(diagUrlConfig));
            }
            
            break;
        }
        case MSPCommand::READ_CERTS:
            {
            //     int size1 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_MQTT_CLIENT0);
            //     int size2 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_MQTT_KEY0);
            //     int size3 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_CERT_UPGRADE_CONFIG);
            //     int size4 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_EAP_CLIENT0);
            //     int size5 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_EAP_KEY0);

            //     int size6 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_MQTT_CLIENT1);
            //     int size7 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_MQTT_KEY1);
            //     int size8 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_EAP_CLIENT1);
            //     int size9 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_EAP_KEY1);
                //const char* filename;
                // for(int i = 0; i < IUESPFlash::CFG_COUNT;i++){
                //    Serial.print(iuWiFiFlash.getConfigFilename((IUESPFlash::storedConfig)i),filename, );
                //    Serial.print("\t File Size : \t")

