mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
                //     delay(2);
                //     Serial.println( iuWiFiFlash.getFileSize((IUESPFlash::storedConfig)i) );
                //     delay(1);
                // }
                iuWiFiFlash.listAllAvailableFiles(IUESPFlash::CONFIG_SUBDIR);
                //int size6 = iuWiFiFlash.getConfigFilename(IUESPFlash::CFG_STATIC_CERT_ENDPOINT);
                // char cert[size1],eapcert[size3];
                // char key[size2] ,eapkey[size5] ;
                // char url[200];
                // char configdata[size3];
                // iuWiFiFlash.readFile(IUESPFlash::CFG_STATIC_CERT_ENDPOINT,url,200);
            
                // Serial.println("Static CONFIG :");
                // for (size_t i = 0; i < 200; i++)
                // {
                //     Serial.print(url[i]);
                // }
                // Serial.println("static config READ COMPLETED");
                break;
            }
      case MSPCommand::SEND_WIFI_HASH:
            strcpy(wifiHash,buffer);
            break;
       case MSPCommand::SEND_CERT_HASH:
            strcpy(certHash,buffer);
            break;
      case MSPCommand::SEND_DIAG_CERT_HASH:
            strcpy(diagCertHash,buffer);
            break;      
      case MSPCommand::SEND_MQTT_HASH:
            strcpy(mqttHash,buffer);
            break;
      case MSPCommand::SEND_HTTP_HASH:
            strcpy(httpHash,buffer);
            break;
      case MSPCommand::GET_PENDING_HTTP_CONFIG:
          // Get all the pending configuration messages over http
          
          String response =  accelRawDataHelper.publishConfigMessage(m_bleMAC);
          
          // create the JSON objects 
        //  DynamicJsonBuffer jsonBuffer;
        //  JsonObject& pendingConfigObject = jsonBuffer.parseObject(response); 
          
       /*   String pendingJson;
          
           for (auto configKeyValues : pendingConfigObject) {
               pendingConfigObject["result"][configKeyValues.key];// = configKeyValues.value;
               
             }
           pendingConfigObject.printTo(pendingJson);
        */
         // size_t msgLen = strlen(response);
       //   char fingerprintAlarm[1500];
       //   char featuresThreshold[1500]; 
       //   char fingerprintFeatures[1500];   
          
        //  JsonVariant fingerprintAlarmConfig  = pendingConfigObject["result"]["fingerprintAlarm"];
        //  JsonVariant featuresThresholdConfig = pendingConfigObject["result"]["alarm"];
        //  JsonVariant fingerprintFeaturesConfig = pendingConfigObject["result"]["fingerprint"];
             
          //Serial.println(fingerprintFeaturesConfig.size());
             
       //   fingerprintAlarmConfig.prettyPrintTo(fingerprintAlarm);
       //   featuresThresholdConfig.prettyPrintTo(featuresThreshold);
       //   fingerprintFeaturesConfig.prettyPrintTo(fingerprintFeatures);
          iuSerial->sendLongMSPCommand(MSPCommand::SET_PENDING_HTTP_CONFIG,1000000,response.c_str(),strlen(response.c_str()));
          
          //mqttHelper.publish(COMMAND_RESPONSE_TOPIC, fingerprintAlarm);//response.c_str());
          //mqttHelper.publish(COMMAND_RESPONSE_TOPIC, featuresThreshold);
          //mqttHelper.publish(COMMAND_RESPONSE_TOPIC, fingerprintFeatures);
          //mqttHelper.publish(COMMAND_RESPONSE_TOPIC, response.c_str());
          break;
            
    }
}



/* =============================================================================
    WiFi credentials and config
============================================================================= */

void Conductor::forceWiFiConfig(const char *userSSID, const char *userPSK,
                                IPAddress staticIp, IPAddress gateway,
                                IPAddress subnetMask)
{
    // Credentials
    forgetWiFiCredentials();
    strncpy(m_userSSID, userSSID, wifiCredentialLength);
    strncpy(m_userPassword, userPSK, wifiCredentialLength);
    m_credentialValidator.receivedMessage(0);
    m_credentialValidator.receivedMessage(1);
    // Static IP
    forgetWiFiStaticConfig();
    m_staticIp = staticIp;
    m_gateway = gateway;
    m_subnetMask = subnetMask;
    m_staticConfigValidator.receivedMessage(0);
    m_staticConfigValidator.receivedMessage(1);
    m_staticConfigValidator.receivedMessage(2);
    m_disconnectionTimerStart = millis();  // Reset Disconnection timer
}

/**
 *
 */
void Conductor::forgetWiFiCredentials()
{
    m_credentialValidator.reset();
    for (uint8_t i = 0; i < wifiCredentialLength; ++i)
    {
        m_userSSID[i] = 0;
        m_userPassword[i] = 0;
        m_username[i] = 0;
    }
}

/**
 * Receive new WiFi credentials (SSID and / or PSK)
 */
void Conductor::receiveNewCredentials(char *newSSID, char *newPSK)
{
    if (m_credentialValidator.hasTimedOut())
    {
        forgetWiFiCredentials();
    }
    if (newSSID)
    {
        m_credentialValidator.reset();
        memset(m_userSSID,0x00,wifiCredentialLength);
        memset(m_userPassword,0x00,wifiCredentialLength);
        strncpy(m_userSSID, newSSID, wifiCredentialLength);
        m_credentialValidator.receivedMessage(0);
    }
    if (newPSK)
    {
        strncpy(m_userPassword, newPSK, wifiCredentialLength);
        m_credentialValidator.receivedMessage(1);
    }
    if (m_credentialValidator.completed())
    {
        String info = String(m_userSSID) + "_" + String(m_userPassword);
        hostSerial.sendMSPCommand(MSPCommand::WIFI_CONFIRM_NEW_CREDENTIALS,
                                  info.c_str());
        // Reset disconnection timer before reconnection attempt
        m_disconnectionTimerStart = millis();
        m_disconnectionMqttTimerStart = millis();
        wifiConnectTryFlag = true;
        reconnect(true);
    }
}

/**
 *
 */
void Conductor::forgetWiFiStaticConfig()
{
    m_staticConfigValidator.reset();
    m_staticIp = IPAddress();
    m_gateway = IPAddress();
    m_subnetMask = IPAddress();
    m_dns1 = IPAddress();
    m_dns2 = IPAddress();
}

/**
 * Receive new WiFi static config (static IP, gateway or subnet mask).
 *
 * @param ip: The IP address of either the static IP, gateway or subnet mask.
 * @param idx: An index 0, 1 or 2 corresponding to the kind of IP (static IP,
    gateway or subnet mask)
 */
void Conductor::receiveNewStaticConfig(IPAddress ip, uint8_t idx)
{
    if (m_staticConfigValidator.hasTimedOut())
    {
        forgetWiFiStaticConfig();
    }
    if (idx == 0) { m_staticIp = hostSerial.mspReadIPAddress(); }
    else if (idx == 1) { m_gateway = hostSerial.mspReadIPAddress(); }
    else if (idx == 2) { m_subnetMask = hostSerial.mspReadIPAddress(); }
    else if (idx == 3) { m_dns1 = hostSerial.mspReadIPAddress(); }
    else if (idx == 4) { m_dns2 = hostSerial.mspReadIPAddress(); }
    else { return; }
    m_staticConfigValidator.receivedMessage(idx);
    if (m_staticConfigValidator.completed())
    {
        hostSerial.sendMSPCommand(MSPCommand::WIFI_CONFIRM_NEW_STATIC_CONFIG);
        // Reset disconnection timer before reconnection attempt
        m_disconnectionTimerStart = millis();
        wifiConnectTryFlag = true;
        reconnect(true);
    }
}

/**
 * Request host to know if should sleep & get BLE MAC address.
 *
 * If the host has not answered after hostResponseTimeout, the ESP82 will deep-
 * sleep for deepSleepDuration and then restart.
 */
bool Conductor::getConfigFromMainBoard()
{
    uint32_t startTime = millis();
    uint32_t current = startTime;
    while (uint64_t(m_bleMAC) == 0 && (millis() - startTime) < 2000 )
    {
        if (current - startTime > hostResponseTimeout)
        {   
            if (debugMode)
            {
                debugPrint("Host didn't respond");
            }
            deepsleep();
        }
        delay(500);
        hostSerial.sendMSPCommand(MSPCommand::ASK_BLE_MAC);
         
        // get the IDE Firmware Version from Host
        //hostSerial.sendMSPCommand(MSPCommand::ASK_HOST_FIRMWARE_VERSION);
        m_lastMQTTInfoRequest = current;
        delay(100);
        hostSerial.readMessages();
        current = millis();
    }
    return (uint64_t(m_bleMAC) > 0);
}


