mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
/* =============================================================================
    Wifi connection and status
============================================================================= */

/**
 * Disconnect the clients and the WiFi
 *
 * @param wifiOff If true, set WiFi mode to WIFI_OFF.
 */
void Conductor::disconnectWifi(bool wifiOff)
{
    /***** End NTP server connection *****/
    timeHelper.end();
    /***** Disconnect MQTT client *****/
    if(m_secure == false){
        if (mqttHelper.nonSecureClient.connected())
        {
            mqttHelper.nonSecureClient.disconnect();
        }
    }else{
        if (mqttHelper.client.connected())
        {
            mqttHelper.client.disconnect();
        }
    }    
    /***** Turn off Wifi *****/
    if (WiFi.isConnected())
    {
        WiFi.disconnect(wifiOff);
    }
}
String Conductor :: IpAddress2String(const IPAddress& ipAddress)
{
  return String(ipAddress[0]) + String(".") +\
  String(ipAddress[1]) + String(".") +\
  String(ipAddress[2]) + String(".") +\
  String(ipAddress[3])  ; 
}
/**
 * Disconnect the clients 
 *
 * @param .
 */
void Conductor::disconnectMQTT()
{
    /***** End NTP server connection *****/
    timeHelper.end();
    /***** Disconnect MQTT client *****/
    if (mqttHelper.client.connected())
    {
        mqttHelper.client.disconnect();
    }
}

/**
 * Attempt to connect or reconnect to the WiFi
 *
 * If the WiFi is already connected to the "right" network (see param
 * forceNewCredentials), this function will not affect the Wifi connection.
 *
 * @param forceNewCredentials If true, the function will connect to the
 * user-input SSID and password (m_userSSID and m_userPassword). If the WiFi is
 * already connected to a network with a different SSID and password, this
 * former connection will be interrupted to use the new credentials.
 */
bool Conductor::reconnect(bool forceNewCredentials)
{
    // Ensure that the WiFi is in STA mode (STA only, no AP)
    if (WiFi.getMode() != WIFI_STA)
    {
        WiFi.mode(WIFI_STA);
    }
    // Disconnect the WiFi if new credentials
    if (forceNewCredentials)
    {
        String currentSSID = WiFi.SSID();
        String currentPW = WiFi.psk();
        if (currentSSID.length() == 0 ||
            strcmp(currentSSID.c_str(), m_userSSID) > 0 ||
            currentPW.length() == 0 ||
            strcmp(currentPW.c_str(), m_userPassword) > 0 ||
            !(WiFi.localIP() == m_staticIp) ||
            !(WiFi.gatewayIP() == m_gateway) ||
            !(WiFi.subnetMask() == m_subnetMask))
        {
            // New and different user input for SSID and Password => disconnect
            // from current SSID then reconnect to new SSID
            // ESP.eraseConfig();  // ESP32_PORT_TRUE
            disconnectWifi();
            delay(1000);  // Wait for effective disconnection
        }
    }
    uint32_t current = millis();
    // Connect the WiFi if not connected
    bool wifiConnected = WiFi.isConnected();
    if (!wifiConnected) {
        if (current - m_lastConnectionAttempt < reconnectionInterval) {
            if (debugMode) {
                debugPrint("Not enough time since last connection attempt");
            }
            return false;
        }
        if (!m_credentialValidator.completed()) {
            if (debugMode) {
                debugPrint("Can't connect without credentials");
            }
            return false;
        }

        if(wifiConnectTryFlag == true) {
            wifiConnectTryFlag = false;
            connectToWiFi();
        }

        m_lastConnectionAttempt = current;
        wifiConnected = (waitForConnectResult() == WL_CONNECTED);
        if (debugMode && wifiConnected) {
            debugPrint("Connected to ", false);
            debugPrint(WiFi.SSID());
        }
    }
    // Set light sleep mode if not done // ESP32_PORT_TRUE
    if (wifiConnected && WiFi.getSleep() != WIFI_PS_MIN_MODEM) {
        WiFi.setSleep(WIFI_PS_MIN_MODEM);
    }
    return wifiConnected;
}

void Conductor::connectToWiFi(){

    if (WiFi.getMode() != WIFI_STA)
    {
        WiFi.mode(WIFI_STA);
    }

    if(strncmp(m_wifiAuthType, "NONE", 4)==0)
    {
        WiFi.begin(m_userSSID);
    }
    else if(strncmp(m_wifiAuthType, "WPA-PSK", 7) == 0)
    {
        WiFi.begin(m_userSSID, m_userPassword);
    }
    else if(strncmp(m_wifiAuthType, "STATIC-NONE", 11) == 0 )
    {
        WiFi.config(m_staticIp, m_gateway, m_subnetMask, m_dns1, m_dns2);
        delay(200);
        WiFi.begin(m_userSSID);
    }
    else if(strncmp(m_wifiAuthType, "STATIC-WPA-PSK", 14) == 0)
    {
        WiFi.config(m_staticIp, m_gateway, m_subnetMask, m_dns1, m_dns2);
        delay(200);
        WiFi.begin(m_userSSID, m_userPassword);
    }
    else if(strncmp(m_wifiAuthType, "EAP-PEAP", 8) == 0)
    {
        // TODO Implemenet
    }
    else if(strncmp(m_wifiAuthType, "EAP-TLS", 7) == 0)
    {
        // TODO Implement
    }
    else if(strncmp(m_wifiAuthType, "STATIC-EAP-PEAP", 15) == 0)
    {
        // TODO Implement
    }
    else if(strncmp(m_wifiAuthType, "STATIC-EAP-TLS", 14) == 0)
    {
        // TODO Implement
    }
    else
    {
        WiFi.begin();   // Connects with Internal storage credentials
    }
    
}
/**
 * Wait for WiFi connection to reach a result
 *
 * Unlike the ESP function WiFi.waitForConnectResult, this one handles a
 * connection time-out. If the timeout=0, then it just calls the ESP library
 * function.
 *
 * @return The status WL_CONNECTED, WL_CONNECT_FAILED or disconnect if
 *  STA is off.
 */
uint8_t Conductor::waitForConnectResult()
{
    if (connectionTimeout == 0)
    {
        return WiFi.waitForConnectResult();  // Use ESP function
    }
    else
    {
        uint32_t startT = millis();
        uint32_t current = startT;
        uint8_t status = WiFi.status();
        while(current - startT < connectionTimeout &&
              status != WL_CONNECTED && status != WL_CONNECT_FAILED)
        {
            delay(100);
            status = WiFi.status();
            current = millis();
        }
        if(status == WL_CONNECT_FAILED)
        {
            wifiConnectTryFlag = false;
        }
        return status;
    }
}
/**
 *
 */
void Conductor::checkOtaPacketTimeout()
{
    uint32_t now = millis();
    if (waitingForPktAck == true)
    {
        if (now - pktWaitTimeStr > otaPktAckTimeout)
        {
            waitingForPktAck = false;
            hostSerial.sendMSPCommand(MSPCommand::OTA_DNLD_FAIL, String(getRca(OTA_STM_PKT_ACK_TMOUT)).c_str());//"STM_PKT_ACK_TMOUT");
            if (debugMode)
            {
                debugPrint("Exceeded OTA packet wait time-out");
            }
        }
    }
    if(otaInitTimeoutFlag == true)
    {
        if((millis() - otaInitTimeout) > 3000) {
            otaInitTimeoutFlag = false;
            otaInProgress = false;
            if (debugMode)
            {
                debugPrint("Exceeded OTA Init wait time-out");
            }
        }
    }
}
/**
 *
 */
void Conductor::checkWiFiDisconnectionTimeout()
{
    uint32_t now = millis();
    if (WiFi.isConnected() /*&& mqttHelper.client.connected()*/)
    {
        m_disconnectionTimerStart = now;
    }
    else if (now - m_disconnectionTimerStart > disconnectionTimeout)
    {
        if (debugMode)
        {
            debugPrint("Exceeded disconnection time-out");
        }
        ESP.restart(); // Resetting ESP32 if not connected to WiFi (every 100 Sec.) // ESP32_PORT_TRUE
    }
}

/**
 * @brief 
 * 
 */
void Conductor::checkMqttDisconnectionTimeout()
{
    uint32_t now = millis();
    if ( mqttHelper.client.connected() || mqttHelper.nonSecureClient.connected() )
    {
        m_disconnectionMqttTimerStart = now;
        //Serial.println("\nSet the m_disconnectionTimerStart");
    }
    else if (now - m_disconnectionMqttTimerStart > disconnectionTimeout)
    {
        if (debugMode)
        {
            debugPrint("Exceeded mqtt disconnection time-out");
        }
        delay(1);
    //    certificateDownloadInProgress = false;    
    //    certDownloadInitAck = false;
    //    downloadInitTimer = true;
       resetMqttConnectionFlags();
       mqttHelper.mqttConnected = 0;
       newDownloadConnectonAttempt = 0; 
       newEapCertificateAvailable = false;
       newEapPrivateKeyAvailable = false;
       newMqttcertificateAvailable = false;
       newMqttPrivateKeyAvailable = false;
       newRootCACertificateAvailable = false;
       if(accelRawDataHelper.httpsOEMConfigPresent){
            newOEMRootCACertificateAvailable = false;
        }
       m_disconnectionMqttTimerStart = now;
       //Serial.println("Exceeded mqtt disconnection time-out");
       hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,"ESP32 DEBUG : Exceeded MQTT disconnction timeout");
        // reconnect mqtt client
       if(espResetCount <= espResetAttempt && espResetCount > 0 && WiFi.isConnected()) 
        {
            espResetCount--;
            espResetCount = iuWiFiFlash.updateValue(ESP_RESET_ADDRESS,espResetCount);
            delay(10);
            ESP.restart();
        }
        //loopMQTT();
    }
    if(iuWiFiFlash.readMemory(CONNECTION_MODE) == UNSECURED){
        mqttHelper.nonSecureClient.loop();
    }else if(iuWiFiFlash.readMemory(CONNECTION_MODE) == SECURED){
        mqttHelper.client.loop();
    }
}
/* =============================================================================
    MQTT
============================================================================= */

/**
 * Main MQTT processing function - should called in main loop.
 *
 * Handles the reconnection to he MQTT server if needed and the publications.
 * NB: Makes use of IUMQTT::reconnect function, which may block the execution.
 */
void Conductor::loopMQTT()
{   
    if (mqttHelper.hasConnectionInformations()) {
        if(!mqttHelper.nonSecureClient.connected())
        {
            mqttHelper.reconnect();
        }
        if(mqttHelper.nonSecureClient.connected()){
          m_disconnectionMqttTimerStart = millis();  
        }
        mqttHelper.nonSecureClient.loop();
    } else {
        uint32_t now = millis();
        if (now - m_lastMQTTInfoRequest > mqttInfoRequestDelay) {
            setMQTTConfig();
            m_lastMQTTInfoRequest = now;
        }
    }
}

/**
 * Callback called when a new MQTT message is received from MQTT server.
 *
 * The message can come from any previously subscribed topic (see
 * PubSubClient.subscribe).
 * @param topic The Pubsub topic the message came from
 * @param payload The message it self, as an array of bytes
 * @param length The number of byte in payload
 */
void Conductor::processMessageFromMQTT(const char* topic, const char* payload,
                                       uint16_t length)
{
    if (debugMode)
    {
        debugPrint("MQTT message arrived [", false);
        debugPrint(topic, false);
        debugPrint("] ", false);
        for (int i = 0; i < length; i++)
        {
            debugPrint(payload[i], false);
        }
        debugPrint("");
    }
    char *subTopic;
    subTopic = strrchr(topic, '/');
    if (subTopic == NULL || strlen(subTopic) < 2)
    {
        if (debugMode)
        {
            debugPrint("Last level of MQTT topic not found");
        }
        return;
    }
    if (debugMode)
    {
        debugPrint("Command type is: ", false);
        debugPrint(&subTopic[1]);
    }
    if (strncmp(&subTopic[1], "time_sync", 9) == 0)
    {
        timeHelper.updateTimeReferenceFromIU(payload);
        hostSerial.sendMSPCommand(MSPCommand::SET_DATETIME, payload, length);
    }
    else if (strncmp(&subTopic[1], "config", 6) == 0)
    {
        if(otaInProgress == false) {
            if (length > UART_TX_FIFO_SIZE)
            {   /* FOr OTA Req. MSP commands are getting corrupted, so special handling is added
                   for sending OTA Init Request MQTT message to STM 
                   a. First Init Request with no payload is send to STM. STM then switches to 
                      OTA Usage Mode and stops all data streaming etc, to reduce MSP message traffic  
                   b. After some delay Actual MQTT message with OTA req. is sent to STM, to 
                      start OTA process.  
                      Copying this payload to other buffer and sending in another context
                      doesnt work, so payload is sent with some delay   */
                bool otaReqReceived = false;
                char *Ptr = NULL;
                char *cert = NULL;
       
                Ptr = strstr(payload,"fwBinaries");
                
